app/controllers/users_controller.rb

  def create
    @user = User.new(user_params) # Not the final implementation!
    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "remember_digest") VALUES (?, ?, ?, ?, ?, ?)  [["name", "ali"], ["email", "ali@gmail.com"], ["created_at", "2022-07-09 11:44:40.467613"], ["updated_at", "2022-07-09 11:44:40.467613"], ["password_digest", "[FILTERED]"], ["remember_digest", nil]]